cats/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)

    if @cat.save
---
INSERT INTO "cats" ("color", "name", "sex", "description", "created_at", "updated_at", "birth_date") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "color" = $2, "sex" = $3, "description" = $4, "updated_at" = $5 WHERE "cats"."id" = $6  [["name", "UPDATEDACAT"], ["color", "Spotted"], ["sex", "F"], ["description", "Write a description.afasfasffasfsdfasfsfa"], ["updated_at", "2019-01-30 01:26:02.571579"], ["id", 2]]